## Production: rds
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                   NAME                    |
|--------|-------------------------------------------|
| add    | `aws_rds_cluster_parameter_group.pgaudit` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_rds_cluster_parameter_group.pgaudit will be created
  + resource "aws_rds_cluster_parameter_group" "pgaudit" {
      + arn         = (known after apply)
      + description = "RDS customized cluster parameter group that enables pgAudit"
      + family      = "aurora-postgresql15"
      + id          = (known after apply)
      + name        = "rds-cluster-pg-audit"
      + name_prefix = (known after apply)
      + tags        = {
          + "CostCenter" = "notification-canada-ca-production"
        }
      + tags_all    = {
          + "CostCenter" = "notification-canada-ca-production"
        }

      + parameter {
          + apply_method = "immediate"
          + name         = "log_connections"
          + value        = "1"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "log_disconnections"
          + value        = "1"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "log_min_error_statement"
          + value        = "NOTICE"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "pgaudit.log"
          + value        = "read,role,write,ddl"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "rds.log_retention_period"
          + value        = "1440"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "rds.logical_replication"
          + value        = "1"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "shared_preload_libraries"
          + value        = "pgaudit,pg_stat_statements"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_db_event_subscription.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_event_subscription.notification-canada-ca-cluster"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_subnet_group.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_parameter_group.default"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_parameter_group.pgaudit"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.app_db_user"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_user"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_cloudwatch_log_group.this[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy.this[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy_endpoint.this[\"read_only\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy_endpoint.this[\"read_write\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_iam_role.this[0]"]

35 tests, 19 passed, 16 warnings, 0 failures, 0 exceptions

```

</details>
